       IDENTIFICATION                      DIVISION.
      *-----------------------------------------------------------------
       PROGRAM-ID.                         ATZERET.
      *AUTHOR.                             Natali K.
      *DATE-WRITTEN.                       DD/MM/YYYY.
      *REMARKS.    Factorial of input number (0-16).
      *            NUMBER OUT OUT OF BOUNDS WILL RESULT IN A LOOP UNTIL
      *            A NUMBER FROM 0-16 IS ENTERED.
      *-----------------------------------------------------------------
       ENVIRONMENT                         DIVISION.
      *-----------------------------------------------------------------
       DATA                                DIVISION.
      *-----------------------------------------------------------------
       WORKING-STORAGE                     SECTION.
      *-----------------------------------------------------------------
      *Cxx-KVUIM
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *EZxx-EZER
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *Hxx-HODAOT
      *-----------------------------------------------------------------
       01  H00.
           03 H01-KEKET                    PIC X(30)          VALUE
              'Enter a number between 0-16: '.
           03 H02-SIMAN-ATZERET            PIC X(2)           VALUE
              '!='.
      *-----------------------------------------------------------------
      *IXxx-INDEXIM
      *-----------------------------------------------------------------
       01  IX00.
           03 IX01-I                       PIC 99             VALUE 1.
      *-----------------------------------------------------------------
      *Kxx-KELET
      *-----------------------------------------------------------------
       01  k00.
           03 K01-MISPAR                   PIC 99.
              88 K01-TAKIN                 VALUE 0    THRU 16.
      *-----------------------------------------------------------------
      *Mxx-MONIM
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *MHxx-MAFTECHOT-HASHVAA
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *Pxx-PELET
      *-----------------------------------------------------------------
       01  P00.
           03 P01-ATZERET                  PIC 9(14).
      *-----------------------------------------------------------------
      *PRxx-PARAMETRIM
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *SXxx-SHUROT
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *SWxx-METAGIM
      *-----------------------------------------------------------------
       01  SW00.
           03 SW01-TKINUT                  PIC 9.
              88 SW01-TAKIN                VALUE 1.
              88 SW01-LO-TAKIN             VALUE 0.
      *-----------------------------------------------------------------
      *TVxx-TAVLAOT
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
       PROCEDURE                           DIVISION.
      *-----------------------------------------------------------------
       A-MAIN                              SECTION.
      *-----------------------------------------------------------------
       A-00.
           PERFORM B-KELET UNTIL SW01-TAKIN
           PERFORM C-CHISHUV
           PERFORM D-PELET
           STOP RUN.
       A-EXIT.
           EXIT.
      *-----------------------------------------------------------------
       B-KELET                             SECTION.
      *-----------------------------------------------------------------
       B-00.
           DISPLAY H01-KEKET
           ACCEPT  K01-MISPAR

           EVALUATE TRUE
             WHEN K01-TAKIN
                  SET SW01-TAKIN TO TRUE
           END-EVALUATE.
       B-EXIT.
           EXIT.
      *-----------------------------------------------------------------
       C-CHISHUV                          SECTION.
      *-----------------------------------------------------------------
       C-00.
           MOVE 1 TO P01-ATZERET
           MOVE 1 TO IX01-I
           PERFORM VARYING IX01-I FROM  1
                                  BY    1
                                  UNTIL IX01-I >
                                        K01-MISPAR

             MULTIPLY IX01-I BY P01-ATZERET

           END-PERFORM.

       C-EXIT.
           EXIT.
      *-----------------------------------------------------------------
       D-PELET                             SECTION.
      *-----------------------------------------------------------------
       D-00.
           DISPLAY K01-MISPAR
                   H02-SIMAN-ATZERET
                   P01-ATZERET.

       D-EXIT.
           EXIT.
      *-----------------------------------------------------------------
